poets = [
    {"dynasty": "唐代", "name": "元稹"},
    {"dynasty": "唐代", "name": "王之涣"},
    {"dynasty": "唐代", "name": "王建"},
    {"dynasty": "唐代", "name": "王维"},
    {"dynasty": "唐代", "name": "白居易"},
    {"dynasty": "唐代", "name": "西鄙人"},
]

poems = [
    {
        "title": "行宫",
        "poet_id": 0,
        "poem": "寥落古行宫，宫花寂寞红。白头宫女在，闲坐说玄宗。",
        "translation": "曾经富丽堂皇的古行宫已是一片荒凉冷落，宫中艳丽的花儿在寂寞寥落中开放。幸存的几个满头白发的宫女，闲坐无事只能谈论着玄宗轶事。",
    },
    {
        "title": "登鹳雀楼",
        "poet_id": 1,
        "poem": "白日依山尽，黄河入海流。欲穷千里目，更上一层楼。",
        "translation": None,
    },
    {
        "title": "新嫁娘词",
        "poet_id": 2,
        "poem": "三日入厨下，洗手作羹汤。未谙姑食性，先遣小姑尝。",
        "translation": "新婚三天来到厨房，洗手亲自作羹汤。还不熟悉婆婆的口味，做好先让小姑品尝。",
    },
    {
        "title": "相思",
        "poet_id": 3,
        "poem": "红豆生南国，春来发几枝。愿君多采撷，此物最相思。",
        "translation": "红豆生长在阳光明媚的南方，每逢春天不知长多少新枝。希望思念的人儿多多采摘，因为它最能寄托相思之情。",
    },
    {
        "title": "杂诗三首·其二",
        "poet_id": 3,
        "poem": "君自故乡来，应知故乡事。来日绮窗前，寒梅著花未？",
        "translation": "您是刚从我们家乡来的，一定了解家乡的人情世态。请问您来的时候我家雕画花纹的窗户前，那一株腊梅花开了没有？",
    },
    {
        "title": "鹿柴",
        "poet_id": 3,
        "poem": "空山不见人，但闻人语响。返景入深林，复照青苔上。",
        "translation": "幽静的山谷里看不见人，只听到人说话的声音。落日的影晕映入了深林，又照在幽暗处的青苔上。",
    },
    {
        "title": "竹里馆",
        "poet_id": 3,
        "poem": "独坐幽篁里，弹琴复长啸。深林人不知，明月来相照。",
        "translation": None,
    },
    {
        "title": "送别 / 山中送别",
        "poet_id": 3,
        "poem": "山中相送罢，日暮掩柴扉。春草明年绿，王孙归不归？(明年 一作：年年)",
        "translation": "在深山中送走了好友，夕阳西坠把柴门关闭。待到明年春草又绿的时候，朋友啊你能不能回还？",
    },
    {
        "title": "问刘十九",
        "poet_id": 4,
        "poem": "绿蚁新醅酒，红泥小火炉。晚来天欲雪，能饮一杯无？",
        "translation": None,
    },
    {
        "title": "哥舒歌",
        "poet_id": 5,
        "poem": "北斗七星高，哥舒夜带刀。至今窥牧马，不敢过临洮。",
        "translation": "黑夜里北斗七星挂得高高，哥舒翰勇猛守边夜带宝刀。吐蕃族至今牧马只敢远望，他们再不敢南来越过临洮。",
    },
]
